In [1]:
import pandas as pd
import numpy as np

In [4]:
dict1={'Names':['Aravind','Samar',np.nan,'Siri'],
       'Age':[np.nan,21,32,43],
       'City':['Hyd','Blr','chennai',np.nan]}
dict1

{'Names': ['Aravind', 'Samar', nan, 'Siri'],
 'Age': [nan, 21, 32, 43],
 'City': ['Hyd', 'Blr', 'chennai', nan]}

In [6]:
d1=pd.DataFrame(dict1)

In [7]:
d1.dtypes

Names     object
Age      float64
City      object
dtype: object

In [9]:
dict2={'Names':['Aravind','Samar',None,'Siri'],
       'Age':[np.nan,21,32,43],
       'City':['Hyd','Blr','chennai',None]}
dict2
pd.DataFrame(dict2)

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2     None  32.0  chennai
3     Siri  43.0     None

In [11]:
d2=pd.DataFrame(dict2)
d2.dtypes

Names     object
Age      float64
City      object
dtype: object

In [12]:
d1.isnull()

   Names    Age   City
0  False   True  False
1  False  False  False
2   True  False  False
3  False  False   True

In [14]:
d1.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

In [18]:
d1.isnull().sum()*100/len(d1)

Names    25.0
Age      25.0
City     25.0
dtype: float64

- np.nan: not a number this applicable for numerical columns

In [ ]:
- Generally data has some empty rows
- its is a data problem
- if you read that kind of data you will see Null
- you need to understand it is a data corrupted or really a Null values are there

**Method-1**

**Fill with some random value**

**Method name:fill na**

In [19]:
d1.fillna(40)

     Names   Age     City
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2       40  32.0  chennai
3     Siri  43.0       40

**Method-2**

**we can fill w.r.t columns also**

In [21]:
d1['Age'].fillna(40)

# it will not update
# inplace=False

0    40.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [22]:
d1

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  chennai
3     Siri  43.0      NaN

In [25]:
d1['Age'].fillna(40,inplace=True)
d1

     Names   Age     City
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  chennai
3     Siri  43.0      NaN

**Method-3**
- bfill
- ffill
- pad
- backfill

In [53]:
d1['Names'].fillna(10)
d1

     Names   Age     City
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2       15  32.0  chennai
3     Siri  43.0      NaN

In [61]:
dict1={'Names':['Aravind','Samar',np.nan,'Siri'],
       'Age':[np.nan,21,32,43],
       'City':['Hyd','Blr','chennai',np.nan]}
d1=pd.DataFrame(dict1)
d1

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  chennai
3     Siri  43.0      NaN

In [62]:
d1.fillna(method='bfill')

C:\Users\abhis\AppData\Local\Temp\ipykernel_12404\1914124427.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill')

     Names   Age     City
0  Aravind  21.0      Hyd
1    Samar  21.0      Blr
2     Siri  32.0  chennai
3     Siri  43.0      NaN

In [63]:
d1.fillna(method='ffill')

C:\Users\abhis\AppData\Local\Temp\ipykernel_12404\4088926743.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='ffill')

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2    Samar  32.0  chennai
3     Siri  43.0  chennai

In [64]:
d1.fillna(method='pad')

C:\Users\abhis\AppData\Local\Temp\ipykernel_12404\3282249208.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='pad')

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2    Samar  32.0  chennai
3     Siri  43.0  chennai

In [65]:
d1.fillna(method='backfill',axis=1)

C:\Users\abhis\AppData\Local\Temp\ipykernel_12404\3586447502.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='backfill',axis=1)

     Names   Age     City
0  Aravind   Hyd      Hyd
1    Samar  21.0      Blr
2     32.0  32.0  chennai
3     Siri  43.0      NaN

In [66]:
d1.fillna(method='ffill',axis=1)

C:\Users\abhis\AppData\Local\Temp\ipykernel_12404\13672963.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='ffill',axis=1)

     Names      Age     City
0  Aravind  Aravind      Hyd
1    Samar     21.0      Blr
2      NaN     32.0  chennai
3     Siri     43.0     43.0

In [67]:
d1.fillna(method='pad',axis=1)

C:\Users\abhis\AppData\Local\Temp\ipykernel_12404\1966724371.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='pad',axis=1)

     Names      Age     City
0  Aravind  Aravind      Hyd
1    Samar     21.0      Blr
2      NaN     32.0  chennai
3     Siri     43.0     43.0

In [68]:
d1.fillna(method='bfill',axis=1)

C:\Users\abhis\AppData\Local\Temp\ipykernel_12404\981496262.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill',axis=1)

     Names   Age     City
0  Aravind   Hyd      Hyd
1    Samar  21.0      Blr
2     32.0  32.0  chennai
3     Siri  43.0      NaN

In [ ]:
$method-4$
- mean
    - Numerical values can fill with mean values
    - but mean affect by outliers
    - if we donot have outliers it is best one
- median
    - Numerical values can fill with median values
    - we know that median values doesnot 
    -
- mode
        - mode is useful for categorical data

In [76]:
dict1={'Names':['Aravind','Samar',np.nan,'Siri'],
       'Age':[np.nan,21,32,43],
       'City':['Hyd','Blr','chennai',np.nan]}
d1=pd.DataFrame(dict1)
d1

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  chennai
3     Siri  43.0      NaN

In [79]:
# we already know  we can fill with some values based on specific columns using fram
# d1.fillna(<>)
# d1 represnts all the columns
age_mean=d1['Age'].mean()
d1['Age'].fillna(age_mean)

0    32.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [80]:
age_median=d1['Age'].median()
d1['Age'].fillna(age_mean)

0    32.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [82]:
d1['City'].mode()

0        Blr
1        Hyd
2    chennai
Name: City, dtype: object

In [ ]:
- fill will

$method-5$


**KNN imputer**
- KNN: k neartest neighbours
- k is a hyper parameter means user can choose
- it is distance metic:**Euclidian distance**
- KNN imputer will take the mean of the neigbours value
- the neibhours value can provider useing values=K
- it is under sklearn package
- Under sklearn we have imputer

In [86]:
from sklearn.impute import KNNImputer
KI=KNNImputer()
KI.fit_transform(d1[['Age']])

array([[32.],
       [21.],
       [32.],
       [43.]])